// 로봇 마커 생성 함수
function createRobotMarker(robot, minimapRectClass, selected) {
  // 미니맵의 정보
  const minimapRect = document
    .getElementById(minimapRectClass)
    .getBoundingClientRect();
  // marker 넣을 container
  const container = document.createElement("div");
  container.className = "robot_marker_container";
  container.style.position = "absolute";
  container.style.left =
    ((robot.position[0] + 2750) * 100) / 3299 -
    (20 * 100) / minimapRect.width +
    "%";
  container.style.top =
    ((-robot.position[1] + 2457) * 100) / 3133 -
    (52 * 100) / minimapRect.height +
    "%";
  container.style.display = "flex";
  container.style.alignItems = "flex-start";

  // SVG 로봇 마커 추가
  console.log("selected : ", selected);
  if (selected == robot.id) {
    container.innerHTML = `<svg width="40" height="52" viewBox="0 0 60 106" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M60 48.5C60 63.9579 48.3685 78.4261 33.2985 99.3802C31.6838 101.625 28.3253 101.619 26.7174 99.3689C11.7466 78.4209 0 63.9551 0 48.5C0 31.9315 13.4315 18.5 30 18.5C46.5685 18.5 60 31.9315 60 48.5Z" fill="#303030"/>
<circle cx="30" cy="48.5" r="26" fill="white"/>
<rect x="11.9173" y="34.9173" width="36.1654" height="21.8598" rx="4.58644" fill="#98F5FF" stroke="#222222" stroke-width="1.83458"/>
<path d="M25.0002 49.7969C26.509 51.2869 30.6213 53.3729 35.0002 49.7969" stroke="#222222" stroke-width="1.83458" stroke-linecap="round"/>
<path d="M21.6572 55.8389C23.4213 55.8389 24.832 57.2478 24.832 58.9609C24.832 60.6741 23.4213 62.083 21.6572 62.083C19.8933 62.0828 18.4834 60.674 18.4834 58.9609C18.4834 57.248 19.8934 55.8391 21.6572 55.8389Z" fill="#4E4E4E" stroke="#222222" stroke-width="1.83439"/>
<path d="M21.6572 55.8389C23.4213 55.8389 24.832 57.2478 24.832 58.9609C24.832 60.6741 23.4213 62.083 21.6572 62.083C19.8933 62.0828 18.4834 60.674 18.4834 58.9609C18.4834 57.248 19.8934 55.8391 21.6572 55.8389Z" fill="#4E4E4E" stroke="#222222" stroke-width="1.83439"/>
<path d="M39.7175 55.8389C41.4816 55.8389 42.8923 57.2478 42.8923 58.9609C42.8923 60.6741 41.4816 62.083 39.7175 62.083C37.9536 62.0828 36.5437 60.674 36.5437 58.9609C36.5437 57.248 37.9537 55.8391 39.7175 55.8389Z" fill="#4E4E4E" stroke="#222222" stroke-width="1.83439"/>
<path d="M39.7175 55.8389C41.4816 55.8389 42.8923 57.2478 42.8923 58.9609C42.8923 60.6741 41.4816 62.083 39.7175 62.083C37.9536 62.0828 36.5437 60.674 36.5437 58.9609C36.5437 57.248 37.9537 55.8391 39.7175 55.8389Z" fill="#4E4E4E" stroke="#222222" stroke-width="1.83439"/>
<path d="M24.1016 41.751C24.6701 41.751 25.3633 42.3503 25.3633 43.4004C25.3632 44.4504 24.6701 45.0498 24.1016 45.0498C23.5331 45.0496 22.8409 44.4503 22.8408 43.4004C22.8408 42.3505 23.533 41.7512 24.1016 41.751Z" fill="#222222" stroke="#222222" stroke-width="1.68147"/>
<path d="M36.2065 41.751C36.7751 41.751 37.4683 42.3503 37.4683 43.4004C37.4682 44.4504 36.7751 45.0498 36.2065 45.0498C35.638 45.0496 34.9459 44.4503 34.9458 43.4004C34.9458 42.3505 35.638 41.7512 36.2065 41.751Z" fill="#222222" stroke="#222222" stroke-width="1.68147"/>
<path d="M30 22V7" stroke="#222222" stroke-width="4" stroke-linejoin="round"/>
<circle cx="30" cy="9" r="7" fill="#6BE3F0" stroke="#222222" stroke-width="4"/>
</svg>
`;
    container.style.zIndex = "1";
  } else {
    if (robot.status == 3) {
      container.innerHTML = `
        <svg width="40" height="52" viewBox="0 0 60 90" fill="none" xmlns="http://www.w3.org/2000/svg">
  <path d="M60 32.5C60 47.9579 48.3685 62.4261 33.2985 83.3802C31.6838 85.6253 28.3253 85.6188 26.7174 83.3689C11.7466 62.4209 0 47.9551 0 32.5C0 15.9315 13.4315 2.5 30 2.5C46.5685 2.5 60 15.9315 60 32.5Z" fill="#303030"/>
  <circle cx="30" cy="32.5" r="26" fill="white"/>
  <rect x="11.9173" y="18.9173" width="36.1654" height="21.8598" rx="4.58644" fill="#98F5FF" stroke="#222222" stroke-width="1.83458"/>
  <path d="M25.0002 33.7969C26.509 35.2869 30.6213 37.3729 35.0002 33.7969" stroke="#222222" stroke-width="1.83458" stroke-linecap="round"/>
  <path d="M21.6572 39.8389C23.4213 39.8389 24.832 41.2478 24.832 42.9609C24.832 44.6741 23.4213 46.083 21.6572 46.083C19.8933 46.0828 18.4834 44.674 18.4834 42.9609C18.4834 41.248 19.8934 39.8391 21.6572 39.8389Z" fill="#4E4E4E" stroke="#222222" stroke-width="1.83439"/>
  <path d="M21.6572 39.8389C23.4213 39.8389 24.832 41.2478 24.832 42.9609C24.832 44.6741 23.4213 46.083 21.6572 46.083C19.8933 46.0828 18.4834 44.674 18.4834 42.9609C18.4834 41.248 19.8934 39.8391 21.6572 39.8389Z" fill="#4E4E4E" stroke="#222222" stroke-width="1.83439"/>
  <path d="M39.7175 39.8389C41.4816 39.8389 42.8923 41.2478 42.8923 42.9609C42.8923 44.6741 41.4816 46.083 39.7175 46.083C37.9536 46.0828 36.5437 44.674 36.5437 42.9609C36.5437 41.248 37.9537 39.8391 39.7175 39.8389Z" fill="#4E4E4E" stroke="#222222" stroke-width="1.83439"/>
  <path d="M39.7175 39.8389C41.4816 39.8389 42.8923 41.2478 42.8923 42.9609C42.8923 44.6741 41.4816 46.083 39.7175 46.083C37.9536 46.0828 36.5437 44.674 36.5437 42.9609C36.5437 41.248 37.9537 39.8391 39.7175 39.8389Z" fill="#4E4E4E" stroke="#222222" stroke-width="1.83439"/>
  <path d="M24.1016 25.751C24.6701 25.751 25.3633 26.3503 25.3633 27.4004C25.3632 28.4504 24.6701 29.0498 24.1016 29.0498C23.5331 29.0496 22.8409 28.4503 22.8408 27.4004C22.8408 26.3505 23.533 25.7512 24.1016 25.751Z" fill="#222222" stroke="#222222" stroke-width="1.68147"/>
  <path d="M36.2065 25.751C36.7751 25.751 37.4683 26.3503 37.4683 27.4004C37.4682 28.4504 36.7751 29.0498 36.2065 29.0498C35.638 29.0496 34.9459 28.4503 34.9458 27.4004C34.9458 26.3505 35.638 25.7512 36.2065 25.751Z" fill="#222222" stroke="#222222" stroke-width="1.68147"/>
  </svg>
      `;
    } else {
      container.innerHTML = `<svg width="40" height="52" viewBox="0 0 60 90" fill="none" xmlns="http://www.w3.org/2000/svg">
  <path d="M60 32.5C60 47.9579 48.3685 62.4261 33.2985 83.3802C31.6838 85.6253 28.3253 85.6188 26.7174 83.3689C11.7466 62.4209 0 47.9551 0 32.5C0 15.9315 13.4315 2.5 30 2.5C46.5685 2.5 60 15.9315 60 32.5Z" fill="#8E8E8E"/>
  <circle cx="30" cy="32.5" r="26" fill="white"/>
  <rect x="11.9173" y="18.9173" width="36.1654" height="21.8598" rx="4.58644" fill="#BDEEF3" stroke="#8E8E8E" stroke-width="1.83458"/>
  <path d="M21.6572 39.8387C23.4213 39.8387 24.832 41.2476 24.832 42.9608C24.832 44.6739 23.4213 46.0828 21.6572 46.0828C19.8933 46.0826 18.4834 44.6738 18.4834 42.9608C18.4834 41.2478 19.8934 39.8389 21.6572 39.8387Z" fill="#8E8E8E" stroke="#8E8E8E" stroke-width="1.83439"/>
  <path d="M21.6572 39.8387C23.4213 39.8387 24.832 41.2476 24.832 42.9608C24.832 44.6739 23.4213 46.0828 21.6572 46.0828C19.8933 46.0826 18.4834 44.6738 18.4834 42.9608C18.4834 41.2478 19.8934 39.8389 21.6572 39.8387Z" fill="#8E8E8E" stroke="#8E8E8E" stroke-width="1.83439"/>
  <path d="M39.7178 39.8387C41.4818 39.8387 42.8925 41.2476 42.8926 42.9608C42.8926 44.6739 41.4819 46.0828 39.7178 46.0828C37.9539 46.0826 36.5439 44.6738 36.5439 42.9608C36.544 41.2478 37.9539 39.8389 39.7178 39.8387Z" fill="#8E8E8E" stroke="#8E8E8E" stroke-width="1.83439"/>
  <path d="M39.7178 39.8387C41.4818 39.8387 42.8925 41.2476 42.8926 42.9608C42.8926 44.6739 41.4819 46.0828 39.7178 46.0828C37.9539 46.0826 36.5439 44.6738 36.5439 42.9608C36.544 41.2478 37.9539 39.8389 39.7178 39.8387Z" fill="#8E8E8E" stroke="#8E8E8E" stroke-width="1.83439"/>
  </svg>
  `;
    }
  }

  return container;
}

// marker, label 색상 지정
// function applyColor(robot, selected) {
//   if (selected === robot.id) {
//     return "#12f3fb";
//   }
//   if (robot.status === 1) {
//     // 사용중이라면?
//     return "#ff0000";
//   } else if (robot.battery < 30) {
//     // 배터리가 30 이하라면?
//     return "#f2d406";
//   } else {
//     // 나머지
//     return "#1dd200";
//   }
// }

// 출발지, 목적지 마커 표시
function marking(destin, start, end, className) {
  const startMarkerContainer = document.createElement("div");
  const endMarkerContainer = document.createElement("div");

  let markerLocation;

  if (destin == 0 || destin == 1 || destin == 4) {
    markerLocation = start;
    startMarkerContainer.innerHTML = `<svg width="25" height="34" viewBox="0 0 25 34" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M12.4424 0.657196C18.917 0.657292 24.166 5.9062 24.166 12.3808C24.166 15.4793 22.9704 18.6694 21.0674 21.9424C19.4009 24.8085 17.1715 27.7709 14.6709 30.83L13.583 32.1474C13.0262 32.8153 12.0288 32.8545 11.4199 32.2675L11.3037 32.1425C8.39128 28.6168 5.75173 25.2156 3.83984 21.9414C1.92964 18.67 0.718796 15.4801 0.71875 12.3808C0.71875 5.90614 5.9677 0.657196 12.4424 0.657196Z" fill="#6BE3F0" stroke="#6BE3F0"/>
<path d="M12.2175 17.0466L12.2175 11.8529L12.1367 11.8529L10.549 12.9562L10.549 11.7363L12.2219 10.5747L13.5719 10.5747L13.5719 17.0466L12.2175 17.0466Z" fill="white"/>
</svg>
`;

    startMarkerContainer.style.position = "absolute";
    startMarkerContainer.className = "moving_start_marker";
    startMarkerContainer.style.top = markerLocation.top + "%";
    startMarkerContainer.style.left = markerLocation.left + "%";
    startMarkerContainer.style.display = "flex";
    startMarkerContainer.style.alignItems = "flex-start";

    document.querySelector(className).appendChild(startMarkerContainer);
  }

  if (destin == 2 || destin == 3 || destin == 4) {
    markerLocation = end;
    endMarkerContainer.innerHTML = `<svg width="25" height="34" viewBox="0 0 25 34" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M12.562 0.657837C19.101 0.657837 24.4018 5.95871 24.4019 12.4977C24.4019 15.6271 23.1946 18.8493 21.272 22.1559C19.5884 25.0514 17.3365 28.0446 14.8101 31.1354L13.7114 32.4664C13.1509 33.1391 12.1459 33.1784 11.5327 32.5875L11.4155 32.4606C8.47302 28.8984 5.80593 25.4626 3.87451 22.1549C1.94472 18.85 0.722168 15.6278 0.722168 12.4977C0.722195 5.95873 6.02306 0.657864 12.562 0.657837Z" fill="#6BE3F0" stroke="#6BE3F0"/>
<path d="M10.0191 17.1204L10.0191 16.2005L12.1262 14.1205C12.4344 13.8244 12.673 13.5812 12.8422 13.3909C13.0114 13.1975 13.1292 13.0299 13.1957 12.8879C13.2621 12.7429 13.2954 12.5933 13.2954 12.4393L13.2954 12.4257C13.2954 12.2384 13.2546 12.0737 13.173 11.9317C13.0945 11.7897 12.9797 11.6795 12.8286 11.6009C12.6776 11.5194 12.4978 11.4786 12.2894 11.4786C12.0779 11.4786 11.8906 11.5239 11.7275 11.6145C11.5643 11.7021 11.4374 11.8245 11.3468 11.9816C11.2562 12.1356 11.2109 12.3169 11.2109 12.5254L11.2109 12.548L9.94655 12.548L9.94202 12.5254C9.94202 12.1085 10.0432 11.7414 10.2456 11.4242C10.4511 11.107 10.7335 10.8593 11.093 10.681C11.4556 10.5028 11.8755 10.4137 12.3528 10.4137C12.8029 10.4137 13.1987 10.4937 13.5401 10.6538C13.8845 10.8139 14.1534 11.036 14.3467 11.32C14.5431 11.6039 14.6413 11.9347 14.6413 12.3124L14.6413 12.326C14.6413 12.5737 14.5929 12.8169 14.4962 13.0556C14.3996 13.2912 14.2364 13.5465 14.0068 13.8214C13.7772 14.0963 13.463 14.418 13.0643 14.7866L11.4873 16.2594L11.8543 15.6612L11.8543 16.2594L11.4873 16.0192L14.7364 16.0192L14.7364 17.1204L10.0191 17.1204Z" fill="white"/>
</svg>
`;

    endMarkerContainer.style.position = "absolute";
    endMarkerContainer.className = "moving_start_marker";
    endMarkerContainer.style.top = markerLocation.top + "%";
    endMarkerContainer.style.left = markerLocation.left + "%";
    endMarkerContainer.style.display = "flex";
    endMarkerContainer.style.alignItems = "flex-start";

    document.querySelector(className).appendChild(endMarkerContainer);
  }
}
